src/cf/Catalogs/ПользовательскиеИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПользовательскиеИстории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимыйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Функциональности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУчастияВПроекте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаУчастияВПроекте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФиче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФичи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КритерииДостижения</Name>
					<Comment>Как понять что цель достигнура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ПоляСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ПоляСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Путь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Персона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Функциональность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевоеДействие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыОбъединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВариантыОбъединения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СозданиеFeatureФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеПользовательскойИстории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеНомераПользовательскойИсторииВФиче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеПутиКФичеВПользовательскойИстории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Настраиваемый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РежимыОбъединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>РежимыОбъединения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбъединять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятьИзAgiler</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятьИзFeature</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Персоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Персоны</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КтоОна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕгоПриоритеты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоБолит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КакПомочь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧтоДелает</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БизнесЦель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесЦели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючевоеДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПользовательскиеИстории/Forms/ФормаСинхронизации/Ext/Form/Module.bsl
&НаКлиенте
Перем ВариантыОбъединения;

&НаКлиенте
Процедура Синхронизировать(Команда)
	Если ВариантОбъединения.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран вариант объединения! Синхронизация прервана.";
		Сообщение.Поле = "ВариантОбъединения";
		Сообщение.Сообщить();	

	ИначеЕсли ВариантОбъединения = ВариантыОбъединения.Настраиваемый Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вариант объединения ""Настраиваемый"" в разработке. Следите за обновлениями.";
		Сообщение.Сообщить();	
		
	ИначеЕсли ВариантОбъединения = ВариантыОбъединения.СозданиеFeatureФайла Тогда
		СоздатьФичу();
		
	ИначеЕсли ВариантОбъединения = ВариантыОбъединения.СозданиеПользовательскойИстории Тогда
		СоздатьПользовательскуюИсторию();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФичу() 
	ШаблонФичи = ОбщегоНазначениеКлиент.ПолучитьШаблонФичи();
	
	ПутьКФиче = ПолучитьЗначениеНастроек(ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Путь"));

	НетОшибок = Истина;
	ЗаполнитьШаблон(ПользовательскаяИстория, ШаблонФичи, НетОшибок);
	
	Если НетОшибок Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		
		ТекстовыйДокумент.УстановитьТекст(ШаблонФичи);
		
		ТекстовыйДокумент.НачатьЗапись(Новый ОписаниеОповещения("ВыгрузитьИзФормыЭлементаЗавершение", ЭтотОбъект), ПутьКФиче, КодировкаТекста.UTF8);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеНастроек(Поле) 
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Поле", Поле);
	
	НайденыеСтроки = НастройкиСинхронизации.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденыеСтроки[0].ЗначениеВAgiler;
КонецФункции

&НаКлиенте
Процедура СоздатьПользовательскуюИсторию()
	Если Не КолонкаВзятьИзAgilerЗаполнена() Тогда
		Возврат;		
	КонецЕсли;
	
	СоздатьПользовательскуюИсториюИЗаполнитьНастройкиСинхронизации();
КонецПроцедуры

&НаКлиенте
Функция КолонкаВзятьИзAgilerЗаполнена()
	Результат = Истина;
	
	Текст = "Не заполнены обязательные строки из колонки ""agile""";
	
	ПоляИсключения = Новый Массив;
	
	ПоляИсключения.Добавить(ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Номер"));
	ПоляИсключения.Добавить(ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Путь"));
	ПоляИсключения.Добавить(ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Заголовок"));
	
	ПерваяСтрока = Истина;
	
	Для Каждого Строка Из НастройкиСинхронизации Цикл
		Если ЭтоПолеВИсключениях(Строка.Поле, ПоляИсключения) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.ЗначениеВAgiler) Тогда
			Результат = Ложь;
			
			Текст = Текст + ?(ПерваяСтрока, ": ", "; ")  + Строка.Поле;
			
			ПерваяСтрока = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Текст = Текст + ". Синхронизация прервана!";
	
	Если Не Результат Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СоздатьПользовательскуюИсториюИЗаполнитьНастройкиСинхронизации()
	НастройкиСинхронизацииНаСервере = РеквизитФормыВЗначение("НастройкиСинхронизации");
	
	НоваяПользовательскаяИстория = Справочники.ПользовательскиеИстории.СоздатьЭлемент();
	
	НоваяПользовательскаяИстория.УстановитьНовыйКод();
	НоваяПользовательскаяИстория.Владелец = БизнесЦель;
	
	Для Каждого Строка Из НастройкиСинхронизацииНаСервере Цикл
		Если Строка.Поле = Перечисления.ПоляСинхронизации.Путь Тогда
			НоваяПользовательскаяИстория.ПутьКФиче = Строка.ЗначениеВFeature;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Заголовок Тогда
			НоваяПользовательскаяИстория.Заголовок = Строка.ЗначениеВFeature;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Персона Тогда
			НоваяПользовательскаяИстория.Персона = Строка.ЗначениеВAgiler;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Функциональность Тогда
			НоваяПользовательскаяИстория.НеобходимыйФункционал = Строка.ЗначениеВAgiler;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.КлючевоеДействие Тогда
			НоваяПользовательскаяИстория.КлючевоеДействие = Строка.ЗначениеВAgiler;
			
		КонецЕсли;
	КонецЦикла;
	
	НоваяПользовательскаяИстория.Записать();
	
	ПользовательскаяИстория = НоваяПользовательскаяИстория.Ссылка;
	
	Для Каждого Строка Из НастройкиСинхронизацииНаСервере Цикл
		Если Строка.Поле = Перечисления.ПоляСинхронизации.Номер Тогда
			Строка.ЗначениеВAgiler = НоваяПользовательскаяИстория.НомерФичи;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Заголовок Тогда
			Строка.ЗначениеВAgiler = НоваяПользовательскаяИстория.Заголовок;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Путь Тогда
			Строка.ЗначениеВAgiler = НоваяПользовательскаяИстория.ПутьКФиче;
			
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(НастройкиСинхронизацииНаСервере, "НастройкиСинхронизации");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПолеВИсключениях(ТекущееПоле, ПоляИсключения)
	Результат = Истина;
	
	ИскомоеПоле = ПоляИсключения.Найти(ТекущееПоле);
	Если ИскомоеПоле = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура НайтиFeatureБезНомера(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Выполняеться поиск фичи без номера, первая попавшаяся загружается сюда, для синхронизации";
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьПоляНастроекСинхронизации();
	ЗаполнитьРеквизитыФормыИзПараметров();
	ЗагрузитьТекущийЭлементВНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормыИзПараметров()
	ИменаЗаполняемыхРеквизитов = Новый Массив;
	
	ИменаЗаполняемыхРеквизитов.Добавить("БизнесЦель");
	ИменаЗаполняемыхРеквизитов.Добавить("ПользовательскаяИстория");
	
	Для Каждого ИмяЗаполняемогоРеквизита Из ИменаЗаполняемыхРеквизитов Цикл
		Если Параметры.Свойство(ИмяЗаполняемогоРеквизита) Тогда
			ЭтаФорма[ИмяЗаполняемогоРеквизита] = Параметры[ИмяЗаполняемогоРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	//---
	
	Если ЗначениеЗаполнено(ПользовательскаяИстория) Тогда
		БизнесЦель = ПользовательскаяИстория.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПоляНастроекСинхронизации()
	НастройкиСинхронизацииНаСервере = РеквизитФормыВЗначение("НастройкиСинхронизации");
	
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.Заголовок, "");
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.Путь, "");
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.Номер, "");
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.Персона, Справочники.Персоны.ПустаяСсылка());
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.Функциональность, Справочники.Функциональности.ПустаяСсылка());
	СоздатьПолеНастроекСинхронизации(НастройкиСинхронизацииНаСервере, Перечисления.ПоляСинхронизации.КлючевоеДействие, Справочники.КлючевыеДействия.ПустаяСсылка());
	
	ЗначениеВРеквизитФормы(НастройкиСинхронизацииНаСервере, "НастройкиСинхронизации");
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьЗначенияКолонок(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "НастройкиСинхронизацииЗначениеВAgiler" Тогда
		ТекущийТип = ТипЗнч(Элемент.ТекущиеДанные.ЗначениеВAgiler);
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТекущийТип);
		
		Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
		
		Если ТекущийТип = Тип("Строка") Тогда
			Элемент.ТекущийЭлемент.КнопкаВыбора = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПолеНастроекСинхронизации(Таблица, Поле, Значение)
	НоваяСтрока = Таблица.Добавить();
	
	НоваяСтрока.Поле = Поле;
	НоваяСтрока.ЗначениеВAgiler = Значение;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТекущийЭлементВНастройки()
	Если Не ЗначениеЗаполнено(ПользовательскаяИстория) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСинхронизацииНаСервере = РеквизитФормыВЗначение("НастройкиСинхронизации");
	
	Для Каждого Строка Из НастройкиСинхронизацииНаСервере Цикл
		Если Строка.Поле = Перечисления.ПоляСинхронизации.Заголовок Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.Заголовок;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Путь Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.ПутьКФиче;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Номер Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.НомерФичи;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Персона Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.Персона;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.Функциональность Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.НеобходимыйФункционал;
			
		ИначеЕсли Строка.Поле = Перечисления.ПоляСинхронизации.КлючевоеДействие Тогда
			Строка.ЗначениеВAgiler = ПользовательскаяИстория.КлючевоеДействие;
			
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(НастройкиСинхронизацииНаСервере, "НастройкиСинхронизации");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСинхронизацииПередНачаломИзменения(Элемент, Отказ)
	ОпределитьЗначенияКолонок(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСинхронизацииЗначениеВAgilerНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИзФормыЭлементаЗавершение(ЗаписанУспешно, ДополнительныеПараметры) Экспорт
	Если ЗаписанУспешно Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Feature файл создан.";
		Сообщение.Сообщить();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблон(ТекущийЭлемент, ШаблонФичи, НетОшибок)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеИстории.НомерФичи,
	|	ПользовательскиеИстории.Заголовок,
	|	ПользовательскиеИстории.Персона,
	|	ПользовательскиеИстории.КлючевоеДействие,
	|	ПользовательскиеИстории.НеобходимыйФункционал
	|ИЗ
	|	Справочник.ПользовательскиеИстории КАК ПользовательскиеИстории
	|ГДЕ
	|	ПользовательскиеИстории.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		НетОшибок = Ложь;
		
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ШаблонФичи = СтрЗаменить(ШаблонФичи, "#Номер", ВыборкаДетальныеЗаписи.НомерФичи);
	ШаблонФичи = СтрЗаменить(ШаблонФичи, "#Заголовок", ВыборкаДетальныеЗаписи.Заголовок);
	ШаблонФичи = СтрЗаменить(ШаблонФичи, "#Персона", ВыборкаДетальныеЗаписи.Персона);
	ШаблонФичи = СтрЗаменить(ШаблонФичи, "#КлючевоеДействие", ВыборкаДетальныеЗаписи.КлючевоеДействие);
	ШаблонФичи = СтрЗаменить(ШаблонФичи, "#НеобходимыйФункционал", ВыборкаДетальныеЗаписи.НеобходимыйФункционал);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбъединенияПриИзменении(Элемент)
	ОпределитьРежимОбъединения();
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРежимОбъединения() 
	Если ВариантОбъединения = ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.Настраиваемый") Тогда
		Для Каждого Строка Из НастройкиСинхронизации Цикл
			Строка.РежимОбъединения = Неопределено;
		КонецЦикла;
		
		ДоступностьКолонки = Истина;
		
	ИначеЕсли ВариантОбъединения = ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.СозданиеFeatureФайла") Тогда
		РежимОбъединения = ПредопределенноеЗначение("Перечисление.РежимыОбъединения.ВзятьИзAgiler");
		
		Для Каждого Строка Из НастройкиСинхронизации Цикл
			Строка.РежимОбъединения = РежимОбъединения;
		КонецЦикла;
		
		ДоступностьКолонки = Ложь;
		
	ИначеЕсли ВариантОбъединения = ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.СозданиеПользовательскойИстории") Тогда
		РежимОбъединения = ПредопределенноеЗначение("Перечисление.РежимыОбъединения.ВзятьИзFeature");
		
		Для Каждого Строка Из НастройкиСинхронизации Цикл
			Строка.РежимОбъединения = РежимОбъединения;
			
			Если Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Номер") Тогда
				Строка.РежимОбъединения = ПредопределенноеЗначение("Перечисление.РежимыОбъединения.НеОбъединять");
				
			ИначеЕсли Ложь
				Или Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Персона")
				Или Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.КлючевоеДействие")
				Или Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Функциональность")
				Тогда
				
				Строка.РежимОбъединения = ПредопределенноеЗначение("Перечисление.РежимыОбъединения.ВзятьИзAgiler");
				
			КонецЕсли;
		КонецЦикла;
		
		ДоступностьКолонки = Ложь;
		
	КонецЕсли;
	
	Элементы.НастройкиСинхронизацииРежимОбъединения.Доступность = ДоступностьКолонки;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьFeature(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Каталог = ОбщегоНазначениеСервер.ПолучитьКаталогПроекта(БизнесЦель);
	ДиалогВыбораФайла.Фильтр = "feature|*.feature";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыбратьFeatureФайлЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьFeatureФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Фича = ПрочитатьФичу(ВыбранныеФайлы[0]);
	
	Для Каждого Строка Из НастройкиСинхронизации Цикл
		Если Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Путь") Тогда
			Строка.ЗначениеВFeature = Фича.Путь;
			
		ИначеЕсли Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Номер") Тогда
			Строка.ЗначениеВFeature = Фича.Номер;
			
		ИначеЕсли Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Заголовок") Тогда
			Строка.ЗначениеВFeature = Фича.Заголовок;
			
		ИначеЕсли Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Персона") Тогда
			Строка.ЗначениеВFeature = Фича.Персона;
			
		ИначеЕсли Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.Функциональность") Тогда
			Строка.ЗначениеВFeature = Фича.Функциональность;
			
		ИначеЕсли Строка.Поле = ПредопределенноеЗначение("Перечисление.ПоляСинхронизации.КлючевоеДействие") Тогда
			Строка.ЗначениеВFeature = Фича.КлючевоеДействие;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФичу(ВыбранныйФайл)
	Фича = ПодготовитьФичу();
	
	Фича.Путь = ВыбранныйФайл;
	
	ТекстФичи = Новый ЧтениеТекста(ВыбранныйФайл, КодировкаТекста.UTF8);
	
	Пробел = " ";
	
	ИскомыеКлючевыеСлова = Новый Массив;
	
	ИскомыеКлючевыеСлова.Добавить("Функционал");
	ИскомыеКлючевыеСлова.Добавить("Функциональность");
	ИскомыеКлючевыеСлова.Добавить("Как");
	ИскомыеКлючевыеСлова.Добавить("Я хочу");
	ИскомыеКлючевыеСлова.Добавить("Хочу");
	ИскомыеКлючевыеСлова.Добавить("Чтобы");
	
	ИскомыеКлючевыеСлова.Добавить("Функционал:");
	ИскомыеКлючевыеСлова.Добавить("Функциональность:");
	ИскомыеКлючевыеСлова.Добавить("Как:");
	ИскомыеКлючевыеСлова.Добавить("Я хочу:");
	ИскомыеКлючевыеСлова.Добавить("Хочу:");
	ИскомыеКлючевыеСлова.Добавить("Чтобы:");
	
	ТегНумерации = "@userstory_";
	
	ТекущаяСтрока = ТекстФичи.ПрочитатьСтроку();
	Пока Не ТекущаяСтрока = Неопределено Цикл
		ТекущаяСтрока = УбратьЛишниеПробелыИТабы(ТекущаяСтрока);
		
		Если СтрНайти(ТекущаяСтрока, ТегНумерации) > 0 Тогда
			Фича.Номер = СтрЗаменить(ТекущаяСтрока, ТегНумерации, "");
			
			ТекущаяСтрока = ТекстФичи.ПрочитатьСтроку();
			
			Продолжить;
		КонецЕсли;

		ПервыйПробел = СтрНайти(ТекущаяСтрока, " ",,, 1);
		ТекущееКлючевоеСлово = СокрЛП(Лев(ТекущаяСтрока, ПервыйПробел));
		
		ВторойПробел = СтрНайти(ТекущаяСтрока, " ",,, 2);
		ТекущееСловосочетаник = СокрЛП(Лев(ТекущаяСтрока, ВторойПробел));
		
		ОставшаясяЧасть = СокрЛП(Сред(ТекущаяСтрока, ПервыйПробел));
		
		Для Каждого ИскомоеКлючевоеСлово Из ИскомыеКлючевыеСлова Цикл
			Если ТекущееКлючевоеСлово = ИскомоеКлючевоеСлово Тогда
				Если Ложь
					Или ТекущееКлючевоеСлово = "Функционал"
					Или ТекущееКлючевоеСлово = "Функциональность"
					Или ТекущееКлючевоеСлово = "Функционал:"
					Или ТекущееКлючевоеСлово = "Функциональность:"
					Тогда
					
					Фича.Заголовок = ОставшаясяЧасть;
					
				ИначеЕсли Ложь
					Или ТекущееКлючевоеСлово = "Как"
					Или ТекущееКлючевоеСлово = "Как:"
					Тогда
					
					Фича.Персона = ОставшаясяЧасть;
					
				ИначеЕсли Ложь
					Или ТекущееКлючевоеСлово = "Хочу"
					Или ТекущееКлючевоеСлово = "Хочу:"
					Тогда
					
					Фича.Функциональность = ОставшаясяЧасть;
					
				ИначеЕсли Ложь
					Или ТекущееКлючевоеСлово = "Чтобы"
					Или ТекущееКлючевоеСлово = "Чтобы:"
					Тогда
					
					Фича.КлючевоеДействие = ОставшаясяЧасть;
					
				КонецЕсли;
				
			ИначеЕсли ТекущееСловосочетаник = ИскомоеКлючевоеСлово Тогда
				Если Ложь
					Или ТекущееКлючевоеСлово = "Я хочу"
					Или ТекущееКлючевоеСлово = "Я хочу:"
					Тогда
					
					Фича.Функциональность = ОставшаясяЧасть;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		//-
		
		ТекущаяСтрока = ТекстФичи.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат Фича;
КонецФункции

&НаКлиенте
Функция УбратьЛишниеПробелыИТабы(Знач Строка) 
	Строка = СтрЗаменить(Строка, Символы.Таб, "");
	Строка = СокрЛП(Строка);
	
	КоличествоПробелов = 0;
	Пробел = " ";
	НеразрывныйПробел = Символы.НПП;
	НоваяСтрока = "";
	
	Пока Не ПустаяСтрока(Строка) Цикл
		ТекущийСимвол = Лев(Строка, 1);
		Если Ложь
			Или ТекущийСимвол = Пробел
			Или ТекущийСимвол = НеразрывныйПробел
			Тогда
			
			КоличествоПробелов = КоличествоПробелов + 1;
			
		Иначе
			КоличествоПробелов = 0;	
			
		КонецЕсли;
		
		Если Не КоличествоПробелов > 1 Тогда
			НоваяСтрока = НоваяСтрока + ТекущийСимвол;
		КонецЕсли;
		
		Строка = Сред(Строка, 2);
	КонецЦикла;
	
	Возврат НоваяСтрока;
КонецФункции

&НаКлиенте
Функция ПодготовитьФичу()
	Фича = Новый Структура;
	
	Фича.Вставить("Заголовок");
	Фича.Вставить("Путь");
	Фича.Вставить("Номер");
	Фича.Вставить("Персона");
	Фича.Вставить("Функциональность");
	Фича.Вставить("КлючевоеДействие");
	
	Возврат Фича;
КонецФункции

//---

ВариантыОбъединения = Новый Структура;

ВариантыОбъединения.Вставить("Настраиваемый", ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.Настраиваемый"));
ВариантыОбъединения.Вставить("СозданиеFeatureФайла", ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.СозданиеFeatureФайла"));
ВариантыОбъединения.Вставить("СозданиеПользовательскойИстории", ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.СозданиеПользовательскойИстории"));
ВариантыОбъединения.Вставить("ОбновлениеНомераПользовательскойИсторииВФиче", ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.ОбновлениеНомераПользовательскойИсторииВФиче"));
ВариантыОбъединения.Вставить("ОбновлениеПутиКФичеВПользовательскойИстории", ПредопределенноеЗначение("Перечисление.ВариантыОбъединения.ОбновлениеПутиКФичеВПользовательскойИстории"));
